---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomBoundaryMisalignment
source: html/44412913-995a-6a76-742d-9654e683013e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoomFailures.RoomBoundaryMisalignment Property

[Room] bounding element might be misaligned.

## Syntax (C#)
```csharp
public static FailureDefinitionId RoomBoundaryMisalignment { get; }
```